[
  "Gelatin",
  "Casein",
  "Rennet",
  "Whey",
  "ACETATE: Retinol. Vitamin A. Palmitate . An aliphatic alcohol. Can come from fish liver oil , egg yolks, butter, lemongrass, wheat germ oil, carotene in carrots, etc., synthetics. In cosmetics, creams, perfumes, hair dyes, vitamins, supplements.",
  "Acetylated Hydrogenated Lard Glyceride",
  "Acetylated Lanolin",
  "Acetylated Lanolin Alcohol",
  "Acetylated Lanolin Ricinoleate",
  "Acetylated Tallow",
  "ADRENALINE: From the adrenals of hogs, cattle and sheep. In medicines. Alternatives: synthetics",
  "AFTERBIRTH: Placenta. Placenta Polypeptides Protein. Contains waste matter eliminated by the fetus. Derived from the uterus of slaughtered animals. Animal placenta is widely used in skin creams, shampoos, masks, etc. Doesn't remove wrinkles. Alternatives: kelp, vegetable oils.",
  "ALBUMEN: Egg Albumen. Albumin. In eggs, milk, muscles, blood and in many vegetable tissues and fluids. In cosmetics, albumen is usually derived from egg whites. May cause allergic reactions. In cakes, cookies, candies, other foods. Egg whites sometimes used in \"clearing\" wines.",
  "ALBUMIN: See Albumen.",
  "ALIPHATIC ALCOHOL: See Acetate.",
  "ALLANTOIN: A uric acid from cows, most mammals. Also in many plants . In cosmetics, especially creams & lotions, and used in the treatment of wounds and skin ulcers.",
  "AMBERGRIS: From sperm whale intestines. Used as a fixative in perfumes and as a flavoring in foods and beverages.  Alternatives: synthetic and vegetable fixatives.",
  "Amerachol\"",
  "Aminiuccinate Acid; DL and L Forms",
  "AMINO ACIDS: Animal or plant sources. In cosmetics, vitamins, supplements, shampoos, etc.",
  "AMINOSUCCINATE ACID: DL and L forms. Aspartic Acid. Can be animal or plant  source. Is a nonessential amino acid. In creams and ointments. Sometimes synthesized for commercial purposes.",
  "Ammonium Hydrolyzed Protein",
  "Amniotic Fluid",
  "AMPD Isoteric Hydrolyzed Animal Protein",
  "AMYLASE: An enzyme prepared from the pancreas of hogs. In cosmetics and Inedicines.",
  "ANIMAL BONES: Bone Meal. In some fertilizers, some vitamins and supplements as a source of calcium, also in toothpastes. Alternatives: plant mulch, vegetable compost, dolomite, clay, vegetarian vitamins.",
  "Animal Collagen Amino Acids",
  "Animal Keratin Amino Acids",
  "ANIMAL OILS AND FATS: In foods, cosmetics, etc. Highly allergenic. Plant derivatives are superior. Alternatives: olive oil, wheat germ oil, coconut oil, almond oil, safflower oil, etc.",
  "Animal Protein Derivative",
  "Animal Tissue Extract - Epiderm Oil R",
  "ARACHIDONIC ACID: A liquid unsaturated fatty acid occurring in the liver, brain, glands, and fat of animals. Generally isolated from the liver. In skin creams and lotions to soothe eczema and rashes.",
  "Artificial Colors: Some artificial colors are made with animal ingredients. cochineal is used to make some red dyes. See Carmine.",
  "ASPARTIC ACID: See Aminosuccinate Acid.",
  "ASPIC: An industry alternative for gelatin. Is made from clarified meat, fish or vegetable stocks and gelatin.",
  "B:",
  "Batyl Alcohol",
  "Batyl Isostearate",
  "BEE POLLEN: Collected from the legs of bees. Causes allergic reactions in some people. In supplements, shampoos, toothpastes, deodorants. Too concentrated for human use.",
  "BEE PRODUCTS: From bees. For bees. Bees are selectively bred. Culls are killed. A cheap sugar is substituted for their stolen honey and millions die as a result. Their legs are often torn off by pollen-collecting trap doors.",
  "BEESWAX: Obtained from the honeycomb of bees. Very cheap and traditional, but harmful to the skin. Some companies won't use beeswax as it doesn't permit the skin to breathe. In lipsticks and many other cosmetics, especially face creams, lotions, mascaras, eye creams and shadows, makeup bases, nail whiteners, etc. Used in making candles, crayons and polishes. Alternatives: Paraffin; vegetable oils and fats; ceresin, made from the mineral ozokerite ; carnauba wax from the Brazilian palm tree ; synthetic beeswax.",
  "BENZOIC ACID: In almost all vertebrates and in berries. In mouthwashes, deodorants, creams, aftershave lotions, perfumes, foods, beverages. Alternatives: gum benzoin  from the aromatic balsamic resin from trees grown in China, Sumatra, Thailand and Cambodia.",
  "Benzyltrimonium Hydrolyzed Animal Protein",
  "BETA CAROTENE: Provitamin A. Carotene. Found in many animal tissues an in all plants. Used as a coloring in cosmetics and in the manufacture of Vitamin A.",
  "BIOTIN: Vitamin H. Vitamin B Factor. In every living cell and in larger amounts in milk and yeast. Used in cosmetics, shampoos, creams. Alternatives: plant sources.",
  "BLOOD: This should be obvious but if it isn't... From any slaughtered animal. Used in cheese making, foam rubber, intravenous feedings, medicines and as adhesive in plywood. Possibly in foods as lecithin . Alternatives: synthetics, plant sources.",
  "BOAR BRISTLES: Hair from wild or captive hogs. In \"natural\" toothbrushes, hairbrushes, bath brushes, cosmetic brushes and shaving brushes. Alternatives: vegetable fibers, nylon.",
  "BONE ASH: Bone Earth. The ash of burned bones, used as a fertilizer, in making ceramics and in cleaning and polishing compounds.",
  "BONEBLACK: Bone Charcoal. A black pigment containing about 10% charcoal made by roasting bones in an airtight container. Used in aquarium filters and in refining cane sugar. In eye shadows, polishes.",
  "BONE CHARCOAL: See Boneblack",
  "BONE EARTH: See Bone Ash",
  "BONE MEAL: See Animal Bones",
  "Brain Extract",
  "Buttermilk",
  "C:",
  "C30-46 Piscine Oil",
  "CALCIFEROOL: Vitamin D. Ergocalciferol . Vitamin D3. Vitamin D can come from fish-liver oil, eggs, milk, butter. Vitamin D2 is made by irradiating ergosterol, a provitamin from plants or yeast. Vitamin D3 is from fish-liver oil. In creams, lotions, other cosmetics, vitamins. Alternatives: sunshine, plant sources, synthetics.",
  "CALCIUM CARBONATE: Calcite. Aragonite. A white or colorless powder, crystalline compund, found mainly in limestone, marble and chalk, bones, teeth, shells and plant ash.",
  "CALCIUM HYDROXIDE: Slaked lime, a white crystalline compound prepared by the action of water on Calcium Oxide, used in making alkalies, bleaching powder, etc.",
  "CALCIUM OXIDE: a white soft, caustic solid, prepared by heating Calcium Carbonate; lime: used in making mortar and plaster, and in ceramics.",
  "CALCIUM PHOSPHATE: Any number of phosphates of calcium found in bones, teeth, and other animal tissues and used in medicine and in the manufacture of enamels, glass, cleaning agents, etc.",
  "Calfskin Extract",
  "Cantharides Tincture - Spanish Fly",
  "Carbamide - Urea, urine",
  "Carmine - Cochineal",
  "Carminic Acid - Natural Red No. 4 ",
  "CAPRYLIC ACID: Can come from cow or goat milk. Also from palm and coconut oil, other plant oils. In perfumes, soaps.",
  "CARBAMIDE: Urea. Imidazolidinyl Urea. Uric Acid. Found in urine and other body fluids. Also produced synthetically In deodorants, ammoniated dentifrices, mouthwashes, hair colorings, hand creams, lotions, shampoos, etc. Used to \"brown\" baked goods such as pretzels.",
  "CARMINE: Cochineal. Carminic Acid. E120. Red pigment from the crushed female cochineal insect. Reportedly 70,000 beetles may be killed to produce one pound of this red dye. Used in cosmetics, shampoos, red apple sauce and other foods. May cause allergic reactions. Alternatives: beet juice, no known toxicity ; alkanet root, from the root of an herblike tree, no known toxicity .",
  "CARMINIC ACID: See Carmine.",
  "CAROTENE: See Beta Carotene.",
  "CASEIN: Caseinogen. Milk protein. In \"non-dairy\" creamers, many cosmetics, hair preparations, beauty masks. Alternatives: soy protein, vegetable milks.",
  "CASEINOGEN: See Casein.",
  "CASTOR: Castoreum. From muskrat and beaver genitals. Used in perfumes and incense. Castor oil comes from the castor bean and is used in many cosmetics. Alternatives: synthetics, plant sources.",
  "CASTOREUM: See Castor.",
  "CATGUT: Tough cord or thread made from the intestines of sheep, horses, etc. Used for surgical sutures and for stringing tennis rackets and musical instruments, etc. Alternatives: nylon & other man-made fibers.",
  "Catharidin",
  "Ceteth-2 - Poltethylene  Cetyl Ether",
  "Ceteth-2, -4, -6, -10, -30",
  "CETYL ALCOHOL: Cetyl Lactate. Cetyl Myristate. Cetyl Palmitate. Ceteth-1, 02, etc. Wax found in spermaceti from sperm whales or dolphin. Used in lipsticks, mascaras, nail polish removers, hand lotions, cream, rouges and many other cosmetics, shampoos, hair lacquers and other hair products, deodorants, antiperspirants  Alternatives: vegetable cetyl alcohol  synthetic spermaceti.",
  "CETYL LACTATE: See Cetyl Alcohol.",
  "CETYL MYRISTATE/ CETETH-: See Cetyl Alcohol.",
  "CETYL PALMITATE: See Spermaceti and Cetyl Alcohol.",
  "CHOLESTERIN: Cholesterol. A steroid alcohol, especially in all animal fats and oils, nerve tissue, egg yolk and blood. Can be derived from lanolin . In cosmetics, eye creams, shampoos, etc. Alternatives: plant sources, synthetics.",
  "CHOLESTEROL: See Cholesterin.",
  "CHOLINE BITARTATE: Lecithin. In all living organisms. Frequently obtained for commercial purposes from eggs and soybeans . Also from nerve tissue, blood, milk, corn. Choline bitartrate, the basic constituent of lecithin, is in many animal and plant tissues or prepared synthetically. Lecithin can be in eye creams, lipsticks, liquid powders, hand creams, lotions, soaps, shampoos, other cosmetics, candies, other foods and medicines.",
  "Chondroitin: Made from animal cartilage, such as tracheas or shark cartilage.",
  "CIVET. Obtained from the civet, a small mammal, by stimulating it, usually through torture. Civets are kept captive in cages in horrible conditions. Used in perfumes as a fixative.",
  "COCHINEAL : See Carmine.",
  "COD LIVER OIL: Fish Liver Oil. Fish Livers. Used in Lubricating creams and lotions, vitamins and supplements. In milk fortified with Vitamin D. Alternatives: vegetable oils, yeast extract ergosterol, sunshine.",
  "Coleth-24",
  "COLLAGEN: A fibrous protein in vertebrates. Usually derived from animal tissue. In cosmetics. Can't affect the skin's own collagen. Alternatives: soy protein, almond oil, amla oil .",
  "CORTICO STEROID: Cortisone. Hormone from cattle liver. Widely used in medicine. Alternatives: synthetics.",
  "CORTISONE: See Cortico Steroid.",
  "CYSTEINE, L-Form: Cystine. Two amino acids which can come from animals.",
  "Used in hair products and creams, in some bakery products and wound healing formulations. Alternatives: Plant sources.",
  "CYSTINE: See Cysteine, L-Form.",
  "D:",
  "Dea-Oleth-10 Phosphate",
  "DNA/RNA: Deoxyribonucleic Acid. Ribonucleic Acid. Polypeptides. Obtained from slaughterhouse wastes. In all living cells. Used in many protein shampoos and cosmetics. Alternatives: plant cells.",
  "DEOXYRIBONUCLEIC ACID: See DNA/RNA.",
  "DEPANTHENOL: Panthenol. Vitamin B Complex Factor. Provitarnin B5. Can come from animal or plant sources or synthetics. In shampoos, foods, supplements, emollients, etc.",
  "Desamido Animal Collagen",
  "Desamidocollagen",
  "Dicapryloyl Cystine",
  "Diethylene Tricaseinamide",
  "DIGLYCERIDES: Monoglycerides. Glycerides. From animal fat. In margarines, cake mixes, confectionaries, foods, peanut butter, non-dairy coffee creamer, cosmetics, etc. Glycerin. Alternatives: vegetable monoglycerides and diglycerides, synthetics.",
  "Dihydrocholesterol",
  "Dihydrocholesterol Octyledecanoate",
  "Dihydrocholeth-15",
  "Dihydrocholeth-30",
  "Dihydrogenated Tallow Benzylmoniumchloride",
  "Dihydrogenated Tallow Methylamine",
  "Dihydrogenated Tallow Phthalate",
  "Dihydroxyethyl Tallow Amine Oxide",
  "Dimethyl Hydrogenated Tallowamine",
  "Dimethyl Tallowamine",
  "Disodium Hydrogenated TallowGlutamate",
  "Disodium Tallamido Mea-Sulfosuccinate",
  "Disodium Tallowaminodipropionate",
  "Ditallowdimonium Chloride",
  "DOWN: Goose or duck insulating feathers. Often from slaughtered or cruelly exploited geese. Used in pillows and as an insulator in quilts, parkas and sleeping bags. Bad in cold, wet weather as it packs down. Alternatives: many polyester and man-made substitutes, superior in many ways; Kapok ; milkweed seed pod fibers.",
  "Dried Buttermilk",
  "Dried Egg Yolk",
  "DUODENUM SUBSTANCES: From the digestive tracts of cattle and swine. In some vitamins and medicines. Alternatives: vegetarian vitamins, synthetics.",
  "E:",
  "E120: See Carmine.",
  "E542",
  "Edible Bone Phosphate",
  "Egg",
  "EGG ALBUMEN/ALBUMIN: See Albumen.",
  "Egg Oil",
  "Egg Powder",
  "EGG PROTEIN: In shampoos, skin preparations, etc. Alternatives: plant proteins.",
  "Egg Yolk",
  "Egg Yolk Extract",
  "ELASTIN: Found in the neck ligaments and aorta of bovine. Similar to collagen. Can't affect the skin's own elasticity. Alternatives: synthetics, proteins from plant tissues.",
  "Embryo Extract",
  "ERGISTEROL: See Calciferool.",
  "ERGOCALCIFEROL: See Calciferool.",
  "ESTRADIOL: Estrone. Estrogen. From cow ovaries and pregnant mares' urine. Considered a drug. Can have harmful systemic effects if used by children. Used for reproductive problems and in birth control pills. In creams and lotions. Has no effect in the creams as a \"nourishing\" factor and simple vegetable source creams are considered better. Alternatives: Oral contraceptives marketed today are usually based on synthetic steroids. Phytoestrogens  are being researched currently.",
  "Estradiol Benzoate",
  "ESTROGEN: See Estradiol.",
  "ESTRONE: See Estradiol.",
  "Ethyl Arachidonate",
  "Ethyl Ester of Hydrolyzed Animal Protein",
  "Ethyl Morrhuate - Lipineate",
  "Ethylene Dehydrogenated Tallowamide",
  "F:",
  "FATTY ACIDS: Can be one or any mixture of liquid and solid acids, caprylic, myristic, oleic, palmitic, stearic , behenic. Used in bubble baths, lipsticks, soaps, detergents, cosmetics, shampoos, foods. Alternatives: vegetable-derived acids, soy lecithin, safflower oil, bitter almond oil, sunflower oil, etc.",
  "FEATHERS: Down. Keratin. Generally from exploited and/or slaughtered birds. Can be used as ornaments in whole or can be ground up in shampoos, etc.",
  "Fish Glycerides",
  "FISH LIVER: See Cod Liver Oil.",
  "FISH LIVER OIL: See Cod Liver Oil.",
  "FISH OIL: Marine Oil. From fish or marine mammals . Used in soap making, candles, lubricants, paints and as a shortening . US regulations currently prohibit the use of ingredients derived from marine mammals.",
  "FISH SCALES: Used in shimmery makeups . Garbage cans full of scales are sold to manufacturers. Alternatives: mica, rayon.",
  "FLETAN OIL: Rare ingredient derived from fish liver which includes lecithin, Vitamin A and Vitamin D.",
  "FUR: Hopefully speaks for itself.",
  "G:",
  "GELATIN: Sometimes Gel. Protein obtained by boiling skin, tendons, ligaments or bones with water, from cattle and hogs. Used in shampoos, face masks, other cosmetics. Used as a thickener for fruit gelatins and puddings . In candies, marshmallows, cakes, ice cream, yogurts. On photographic film as a coating and in vitamins as capsules. Sometimes used to assist in \"clearing\" wines. Alternatives: algae and seaweed , Gelozone, used in jellies, plastics, medicines, pectin from fruit, dextrins, locust bean gum and cotton gum. Marshmallows were originally made from the root of the marshmallow plant.",
  "GEL: See Gelatin,",
  "Glucosamine: Made from the shells of crabs, lobster, and shrimp.",
  "Glucuronic Acid",
  "GLUTAMIC ACID: An amino acid found widely in plant and animal tissue. Used as food seasoning and as an antioxidant in cosmetics.",
  "GLYCERIDES: See Diglycerides.",
  "GLYCERIN: Glycerine. Glycerol. Polyglycerol. Polytethylene Glycol . A byproduct of soap manufacture . In cosmetics, foods, mouthwashes, toothpastes, soaps, ointments, medicines, lubricants, transmission and brake fluids, plastics. Alternatives: vegetable or vegetable glycerin, a by-product of vegetable oil soap; derivatives of seaweed, petroleum.",
  "GLYCERINE: See Glycerin,",
  "GLYCEROL: See Diglycerides.",
  "Glyceryl Lanolate",
  "Glycogen",
  "GOOSE INSULATING FEATHERS: See Down.",
  "GUANINE: Pearl Essence. Obtained from scales of fish. Constituent of ribonucleic acid and deoxyribonucleic acid and is found in all animal and plant tissues. In shampoos, nail polish, other cosmetics. Alternatives: leguminous plants, synthetics.",
  "H:",
  "Heptylundecanol",
  "HIDE GLUE: Same as gelatin but of a cruder, more impure form. Alternatives: dextrins and synthetic petrochemical-based adhesives.",
  "HONEY. Food for bees, made by bees. Still a sugar, too concentrated for humans. Contains toxins harmful to humans. Can cause allergic reactions. In cosmetics, foods. Alternatives: Maple syrup, date sugar, syrups made from grains.",
  "HORSE HAIR AND OTHER ANIMAL HAIR: In some blankets, mattresses, brushes, furniture, etc. Alternatives: vegetable and man-made fibers.",
  "Human Placental Protein",
  "Human Umbilical Extract",
  "Hyaluronic Acid",
  "Hydrogenated Animal Glyceride",
  "Hydrogenated Ditallow Amine",
  "Hydrogenated Honey",
  "Hydrogenated Laneth-5, -20, -25",
  "Hydrogenated Lanolin",
  "Hydrogenated Lanolin Alcohol",
  "Hydrogenated Lard Glyceride",
  "Hydrogenated Shark-Liver Oil",
  "Hydrogenated Tallow Acid",
  "Hydrogenated Tallow Betaine",
  "Hydrogenated Tallow Glyceride",
  "Hydrolyzed Animal Elastin",
  "Hydrolyzed Animal Keratin",
  "HYDROLYZED ANIMAL PROTEIN: In cosmetics, especially shampoos and hair treatments. Alternatives: soy protein, other vegetable proteins, amla oil .",
  "Hydrolyzed Animal Protein",
  "Hydrolyzed Casein",
  "Hydrolyzed Elastin",
  "Hydrlyzed Human Placental Protein",
  "Hydrolyzed Keratin",
  "HYDROLYZED MILK PROTEIN: Milk Protein. From cows' milk. In cosmetics, shampoos, moisturizers, conditioners, etc. Alteratives: soy protein, other plant proteins.",
  "Hydrolyzed Silk",
  "Hydroxylated Lanolin",
  "I:",
  "IMIDAZOLIDINYL UREA: See Carbamide,",
  "INSULIN: From the pancreas of hogs and oxen. Used by millions of diabetics daily. Alternatives: synthetics, human insulin grown in a lab, diet when possible.",
  "ISINGLASS: A form of gelatin prepared from the internal membranes of fish bladders. In foods and sometimes used in \"clearing\" wines and beers. Alternatives: bentonite clay, \"Japanese isinglass\". Isinglass is also a mineral, mica, used in cosmetics.",
  "Isobutylated Lanolin",
  "Isopropyl Lanolate",
  "ISOPROPYL MYRISTATE: Myristate Acid. Myristyl. In most animal and vegetable fats. In butter acids. Used in shampoos, creams, cosmetics, food flavorings. Alternatives: nut butters, oil of lovage, coconut oil, extract from seed kernels of nutmeg, etc.",
  "Isopropyl Tallowatelsopropyl Lanolate",
  "Isostearic Hydrolyzed Animal Protein",
  "Isostearoyl Hydrolyzed Animal Protein",
  "K:",
  "KERATIN: From the ground-up horns, hoofs, feathers, quills and hair of various creatures. In hair rinses, shampoos, permanent wave solutions. Alternatives: almond oil, soy protein, amla oil , rosemary, nettle. Rosemary and nettle give body and strand strength to hair.",
  "Keratin Amino Acids",
  "L:",
  "L-FORM: See Cysteine.",
  "L-LACTIC ACID: Lactic Acid . Produced by the fermentation of lactose when milk sours or from sucrose and some other carbohydrates by the action of certain microorganisms. Can be found in blood and muscle tissue. In skin fresheners, adhesives, plasticizers, pharmaceuticals, sour milk, beer, sauerkraut, pickles and other food products made by bacterial fermentation. Used in foods and beverages as an acidulant, flavoring and preservative.",
  "LACTIC ACID: See L-Lactic Acid.",
  "Lactic Yeasts",
  "LACTOSE: Milk Sugar. Milk of Mammals. In eye lotions, foods, tablets, cosmetics, baked goods, medicines, shampoos. Alternatives: plant milk sugars.",
  "Laneth-5 through -40",
  "Laneth-9 and -10 Acetate",
  "LANOLIN: Lanolin Acid. Lanolin Alcohols . Wool Fat. Laneth-5, -10, etc. Lanogene. Lanosterol. Isopropyl Lanolate. A product of the oil glands of sheep, extracted from their wool. In many skin care products and cosmetics and in medicines. Some cosmetic companies won't use it because it commonly causes allergic contact skin rashes, and also they consider it to be a cheap filler. Vegetable sources are thought to be better moisturizers; lanolin is too greasy, waterproof and sealing - skin can't breathe.",
  "LANOLIN ACID: See Lanolin.",
  "LANOLIN ALCOHOLS: See Lanolin.",
  "Lanolin Linoleate",
  "Lanolin Oil",
  "Lanolin Ricinoleate",
  "Lanolin Wax",
  "Lanoinamide DEA",
  "LANOSTEROL: See Lanolin.",
  "LARD: Fat from hog abdomens. In shaving creams, soaps, cosmetics, baked goods and other foods. Hard to digest. Alternatives: vegetable fats or oils.",
  "Lard Glyceride",
  "Lauroyl hydrolyzed Animal Protein",
  "LEATHER: Suede, Calfskin. Sheepskin. Alligator. Kid. Euphemism for animal skin. The use of and sale of it subsidizes the meat industry. Used to make wallets, handbags, belts, furniture and car upholstery, shoes, coats, etc. Alternatives: natural materials such as cotton and canvas. Also man-made materials such as nylon and vinyl.",
  "LECITHIN: See Choline Bitartrate.",
  "Leucine",
  "L-Lactic Acid",
  "LINOLEIC ACID: An essential fatty acid. In cosmetics, vitamins.",
  "LIPASE: Enzyme from the stomachs and tongue glands of calves, kids and lambs. Probably in some vitamins. Alternatives: vegetable enzymes.",
  "LIPOIDS/ LIPIDS: Fat and fat-like substances which occur in animals and plants.",
  "Liver Extract",
  "LUNA SPONGE: Sea Sponge. A plant-like animal that lives in the sea and is becoming scarce. Alternatives: man-made sponges.",
  "Lysine",
  "M:",
  "Magnesium Lanolate",
  "Magnesium Tallowate",
  "Mammarian Extract",
  "MARINE OIL: See Fish Oil.",
  "Mayonnaise",
  "MEA-Hydrolyzed Animal Protein",
  "Menhaden Oil - Pogy Oil; Mossbunker Oil",
  "METHIONINE: An essential amino acid found in various proteins. Used as a texturizer in creams.",
  "MILK OF MAMMALS: If this isn't already obvious, see Lactose.",
  "MILK PROTEIN: Hydrolyzed Milk Protein. From cows' milk. In cosmetics, shampoos, moisturizers, conditioners, etc. Alteratives: soy protein, other plant proteins.",
  "MILK SUGAR: See Lactose.",
  "MINK OIL: From minks. In cosmetics, creams, etc. Alternatives: vegetable oils and emollients .",
  "Minkamidopropyl Diethylamine",
  "MONOGLYCERIDES: See Diglycerides.",
  "Muscle Extract",
  "MUSK: Obtained from the genitals of the Northern Asian small hornless deer. In perfumes and food flavorings. Can cause allergic reactions. Alternatives: labdanum  - no known toxicity. Other plants have a musky scent also.",
  "Musk Ambrette",
  "MYRISTATE ACID: See Isopropyl Myristate.",
  "MYRISTYL: See Isopropyl Myristate.",
  "Myristoyl Hydrolyzed Animal Protein",
  "N:",
  "NATURAL FLAVOR: Natural Flavoring. Natural Source. Can mean animal, vegetable or mineral source. Most often in the health food industry, it means an animal source, especially in cosmetics . Be wary of this term. Find out exact source.",
  "NATURAL SOURCE: See Natural Flavor.",
  "NUCLEIC ACID: In the nucleus of all living cells. Used in cosmetics, shampoos, conditioners, vitamins, supplements, etc. Alternatives: plant sources.",
  "O:",
  "OCTYL DODECANOL: Mixture of solid waxy alcohols. Primarily from stearyl alcohol.",
  "OLEAN速: Olestra速. A man-made fat substitude that contains fatty acids. Originally planned to be marketed as a drug. Depletes body of, and prevents absorbtion of vitamins. In some potato chips and other fried foods. Alternatives: plant sources.",
  "Oleamidopropyl Dimethylamine Hydrolyzed Animal Protein",
  "OLEIC ACID: Oleth-2, -3, -20, etc. Oleyl Alcohol. Oleamine. Oleyl Betaine. Obtained from various animal and vegetable fats and oils, Is usually obtained commercially from inedible tallow, sometimes synthesized from petroleum. In foods, soft soaps, bar soaps, permanent wave solutions, shampoos, creams, nail polish, lipsticks, liquid makeups, many other skin preparations. Alternatives: coconut oil; see alternatives for animal oils and Fats.",
  "Oleostearine",
  "Oleoyl Hydrolyzed Animal Protein",
  "OLESTRA速: See Olean速.",
  "OLETH-2, -3-20, 25, 50 ETC./ OLEYL ALCOHOL/ OLEAMINE/ OLEYL BETAINE: See Oleic Acid.",
  "Oleyl Betatine",
  "OLYL ALCOHOL/ BETAINE: See Oleic Acid.",
  "Oleyl Arachidate",
  "Oleyl Imidazoline",
  "Oleyl Lanolate",
  "Ovarian Extract",
  "OX BILE: Oxgall. From castrated bovines. In creams.",
  "OXGALL: See Ox Bile.",
  "P:",
  "PALMITATE: Palmitic Acid. Fatty Acids. From fats, oils, mixed with stearic acid. Occurs in many animal fats and plant oils. In shampoos, shaving soaps, creams. Alternatives: palm oil and other vegetable source.",
  "PALMITIC ACID: See Palmitate.",
  "Palmitoyl Hydrolyzed Animal Protein",
  "Palmitoyl Hydrolyzed Milk Protein",
  "PANTHENOL: See Depanthenol.",
  "PEARL ESSENCE: See Guanine.",
  "PEG-28 Glyceryl Tallowate",
  "PEG-8 Hydrogenated Fish Glycerides",
  "PEG-5 through -70 Hydrogenated Lanolin",
  "PEG-13 Hydrogenated Tallow Amide",
  "PEG-5 to -20 Lanolate",
  "PEG-5 through -100 Lanolin",
  "PEG-75 Lanolin Oil and Wax",
  "PEG-2 Milk Solids",
  "PEG-6, -8, -20 Sorbitan Beeswax",
  "PEG-40, -75, or -80 Sorbitan Lanolate",
  "PEG-3, -10, or -15 Tallow Aminopropylamine",
  "PEG-15 Tallow Polyamine",
  "PEG-20 Tallowate",
  "Pentahydrosqualene",
  "PEPSIN: Obtained from the stomachs of hogs. A clotting agent. In some cheeses and vitamins. Same uses and alternatives as rennet.",
  "Perhydrosqualene",
  "Pigskin Extract",
  "PLACENTA: See Afterbirth.",
  "PLACENTA POLYPEPTIDES PROTEIN: See Afterbirth.",
  "Placental Enzymes, Lipids and Proteins",
  "Placental Extract",
  "Placental Protein",
  "POLYGLYCEROL: See Glycerin.",
  "Polyglyceryl-2 Lanolin Alcohol Ether",
  "POLYPEPTIDES: See DNA/RNA.",
  "POLYPEPTIDES PROTEIN: See Afterbirth.",
  "POLYSORBATES: Derivatives of fatty acids. In cosmetics, foods.",
  "POLYTETYLENE GLYCEROL/Glycol/PEG: See Glycerin.",
  "Potassium Caseinate",
  "Potassium Tallowate",
  "Potassium Undecylenoyl Hydrolyzed Animal Protein",
  "PPG-12-PEG-50 Lanolin",
  "PPG-2, -5, -10. -20, -30 Lanolin Alcohol Ethers",
  "PPG-30 Lanolin Ether",
  "Pregnenolone Acetate",
  "PRISTANE: Obtained from the liver oil of sharks and from whale ambergris. See Squalene. Used as a lubricant and anticorrosive agent. In cosmetics.  Alternatives: plant oils, synthetics.",
  "PROGESTERONE: A steroid hormone used in face creams. Can have adverse systemic effects. Alternatives: synthetics.",
  "PROPOLIS: A resinous substance collected from various plants by bees and used in the construction of their hives. In toothpastes, shampoos, deodorants, supplements, etc.",
  "PROVITAMIN A: See Beta Carotene.",
  "PROVITAMIN B5: See Depanthenol.",
  "Purcelline Oil Syn",
  "Q:",
  "QUATERNIUM 27: Tallow. Stearamide. Stearate. Stearic Acid. Stearin. Fat from cows, sheep, etc. . Most often refers to a fatty substance taken from the stomachs of pigs. Can be harsh, irritating. Used in cosmetics, soaps, lubricants, candles, hairsprays, conditioners, deodorants, creams. Alternatives: can be found in many vegetable fats .",
  "R:",
  "RENNET: Rennin. From calves' stomachs. Used in cheesemaking, rennet custard  and in many coagulated dairy products. Alternatives: microbial coagulating agents, bacteria culture, lemon juice.",
  "RENNIN: See Rennet.",
  "RETINOL: See Acetate.",
  "RIBONUCLEIC ACID: See DNA/RNA.",
  "RNA/DNA: See DNA/RNA.",
  "ROYAL JELLY: Secretion of the throat glands of the honeybee workers that is fed to the larvae in a colony and to all queens' larvae. No proven value in cosmetic preparations. Alternatives: aloe vera, cornfrey, other plant derivatives.",
  "S:",
  "SABLE BRUSHES: From the fur of sables . Used to make cosmetic brushes. Alternatives: synthetic furs and fibers.",
  "Saccharide Hydrolysate",
  "Saccharide Isomerate",
  "SEA SPONGE: See Luna Sponge.",
  "SEA TURTLE OIL: Turtle Oil. From the muscles and genitals of giant sea turtles. In soaps, skin creams, nail creams, other cosmetics. Alternatives: Vegetable emollients. ",
  "Serum Albumin",
  "Serum Proteins",
  "Shark-Liver Oil",
  "SHEEPSKIN: See Leather.",
  "SHELLAC: Obtained from the bodies of the female scale insect Tachardia lacca. Shellac is used as varnish, as a coating on wood and plaster, in electrical insulation, and in sealing wax.",
  "Shellac Wax",
  "SILK: Shiny fiber made by silkworms to form their cocoons. Boiled or roasted in their cocoons to get the silk. Used in cloth and silk screening. Alternatives: milkweed seed pod fibers, nylon, silk-cotton tree and ceiba tree filaments , rayon, man-made silks. Other fine cloth can be and is used for silk screening. Taffeta can be made from silk or nylon.",
  "Silk Amino Acids",
  "SILK POWDER: Obtained from the secretion of the silkworm. Used as a coloring agent in face powders, soaps, etc. Causes severe allergic reactions; systemic reactions if inhaled or ingested.",
  "SNAILS: Crushed. In some cosmetics.",
  "Sodium Caseinate",
  "Sodium Chondroitin Sulfate",
  "Sodium Coco-Hydrolyzed Animal Protein",
  "Sodium Hydrogenated Tallow Glutamate",
  "Sodiurn Laneth Sulfate",
  "Sodium Methyl Oleoyl Taurate",
  "Sodium n-Mythyl-n-Oleyl Taurtate",
  "Sodium Soya Hydrolyzed Animal Protein",
  "Sodium Tallow Sulfate",
  "Sodium Tallowate",
  "Sodium / TEA-Lauroyl Hydrolyzed Animal Protein",
  "Sodium / TEA-Undecylenoyl Hydrolyzed Animal Protein",
  "Sodium Undecylenate",
  "Soluble  Collagen",
  "Soya Hydroxyethyl Imidazoline",
  "SPERMACETI: Cetyl Palmitate. Sperm Oil. Waxy oil derived from the sperm whale's head or from dolphins. In skin creams, ointments, shampoos, candles, many margarines. Used in the leather industry. May become rancid and cause irritations.  Alternatives: Synthetic spermaceti, jojobas oil and other vegetable emollients.",
  "SPERM OIL: See Spermaceti.",
  "Spleen Extract",
  "SQUALANE: Squalene. Obtained from shark liver oil. Lubricant and perfume fixative. Alternatives: synthetics.",
  "SQUALENE: Obtained from shark liver oil or vegetable oil. An emollient from a \"natural source\". A precursor of cholesterol in biosynthesis. In cosmetics, moisturizers, hair dyes. Alternatives: vegetable emollients .",
  "STEARAMIDE/ STEARATE/ STEARIN: See Quaternium 27.",
  "STEARIC ACID: See Quaterniun 27.",
  "STEARYL ALCOHOL: Stenol. A mixture of solid alcohols; can be prepared from sperm whale oil. In medicines, creams, rinses, shampoos, etc.  Alternatives: plant tissues, synthetics.",
  "STENOL: See Stearyl Alcohol.",
  "STEROID: Sterol. From various animal glands or from plant tissues. Steroids include sterols. Sterols are alcohols from animals or plants . Used in hormone preparations. In creams, lotions, hair conditioners, fragrances, etc. Alternatives: plant tissues, synthetics.",
  "STEROL: See Steroid.",
  "SUEDE: See Leather.",
  "T:",
  "TALLOW: Tallowate. Tallow Fatty Alcohol. Stearic Acid. Rendered beef or sheep fat. May cause eczema and blackheads. In wax paper, crayons, margarines, paints, rubber, lubricants, candles, soaps, shampoos, lipsticks, shaving creams, other cosmetics. Alternatives: vegetable tallow , Japan tallow, paraffin, ceresin. ",
  "Tallow Acid",
  "Tallow Amide",
  "Tallow Amidopropylamine Oxide",
  "Tallow Amine",
  "Tallow Amine Oxide",
  "Tallow Fatty Alcohol",
  "Tallow Glycerides",
  "Tallow Hydroxyethal Imidazoline",
  "Tallow Imidazoline",
  "TALLOWATE: See Tallow.",
  "Tallowmide DEA and MEA",
  "Tallowmidopropyl Hydroxysultaine",
  "Tallowminopropylamine",
  "Tallowmphoacete",
  "Talloweth-6",
  "TALLOW FATTY ALCOHOL: See Tallow.",
  "Tallow Trimonium Chloride - Tallow",
  "Taurine - is found in the bile of mammals. It can be synthesized",
  "in a lab, but in doing so is encredibly harsh on the environment.",
  "Tea-Abietoyl Hydrolyzed Animal Protein",
  "Tea-Coco Hydrolyzed Animal Protein",
  "Tea-Lauroyl Animal Collagen Amino Acids",
  "Tea-Lauroyl Animal Keratin Amino Acids",
  "Tea-Myristol Hydrolyzed Animal Protein",
  "Tea-Undecylenoyl Hydrolyzed Animal Protein",
  "Testicular Extract",
  "Threonine: natural amino acids, Found in eggs, milk, gelatin...",
  "Triethonium Hydrolyzed Animal Protein Ethosulfate",
  "Trilaneth-4 Phosphate",
  "TURTLE OIL: See Sea Turtle Oil.",
  "U:",
  "UREA: Urine. The waste product of protein metabolism, made by the liver and removed from the body via the kidneys.",
  "URIC ACID: Carbamide. The end product of urine breakdown",
  "V:",
  "VITAMIN A: Retinol. Acetate and Palmitate. ",
  "VITAMIN B COMPLEX FACTOR: Provitamin B5. Depanthenol. Panthenol.",
  "VITAMIN B FACTOR: See Biotin.",
  "VITAMIN B12: Usually from an animal source. Some vegetarian B12 fortified yeasts and analogs available. Some vegetarian B12 vitamins are in a stomach base. Plant algae discovered containing B12, now in supplement form . Also, B12 is produced in a healthy body.",
  "VITAMIN D: See Calciferool.",
  "VITAMIN H: See Biotin.",
  "OTHER VITAMINS: . Many other vitamins can come from animal sources. Alternatives: vegetarian vitamins, plant and mineral sources.",
  "W:",
  "WHEY: From milk. Usually in cakes, cookies, candies, cheese. Alternatives: soybean whey.",
  "WOOL: From sheep . Used in clothing, including blends. Ram lambs and old \"wool\" sheep are slaughtered for their meat and last shearing. Sheep are transported without food or water in extreme heat and cold. Legs are broken, eyes injured, etc. Sheep are bred to be unnaturally woolly. Inferior sheep are killed. Shearing DOES hurt the sheep. They are pinned down violently, sheared roughly. Their skin is cut up. \"Natural\" wool raising uses enormous amounts of resources and energy . Many people are allergic to wool. Alternatives: cotton, cotton flannel, linen, man made fibers.",
  "WOOL FAT: See Lanol.",
  "Wool Wax Alcohols",
  "Y:",
  "Yogurt",
  "Z:",
  "Zinc Hydrolyzed Animal Protein"
]
